# FramingProfileService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..FramingProfileService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service responsible for the generation of the fabrication profile.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId FramingProfileService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FramingProfileService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ FramingProfileService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace